In [1]:
import pandas as pd
from pandasql import sqldf

In [2]:
file_path_staff = '/workspaces/demo-devcontainer-main/resource/staff.csv'
file_path_staff_detail = '/workspaces/demo-devcontainer-main/resource/staff_detail.csv'

df_staff = pd.read_csv(file_path_staff)
df_staff_detail = pd.read_csv(file_path_staff_detail)

In [3]:
sql = """
    select * from df_staff
"""

sqldf(sql)

   ID   Name  DeptId  Age Gender  Salary
0   1   Mike       2   45      M   60000
1   2   Judy       2   30      F   48000
2   3  Allen       1   22      M   50000
3   4    Tom       2   47      M   47000
4   5   Jack       3   36      M   52000
5   6   Abby       2   24      F   45000
6   7  Trump       1   80      M   80000
7   8  Marry       3   29      F   87000